#include <stdio.h>
#include <stdlib.h>
/*Дан вещественный массив A[4][5]. Необходимо определить значения вещественного массива B[4] по правилу:
B[i] = максимальному значению i-й строки массива A, если A[i][0] >= 0.
B[i] = минимальному значению i-й строки массива A, если A[i][0] < 0.
Значение переменной i изменяется от 0 до 3.*/
int main() {
    /*int A[4][5]={{-6,2,3,4,15},
                 {-1,-2,13,40,-5},
                 {-9,8,7,120,5},
                 {-9,88,-7,-16,-50}};*/
    int A[4][5];
    int B[4];
    int x, y;
    for(int i=0; i<4; ++i) {
        for(int j=0; j<5; ++j) {
            scanf("%d",&A[i][j]);
        }
    }
    for(int i=0; i<4; ++i) {
        for(int j=0; j<5; ++j) {
            printf("%d\t",A[i][j]);
        }
        printf("\n");
    }
    for(int i=0; i<4; ++i) {
        x=A[i][0];
        if(A[i][0]>=0) {
            for(int j=0; j<5; ++j) {
                if(x<=A[i][j]) {
                    x=A[i][j];
                    B[i]=x;
                }
            }
        } else {
            for(int j=0; j<5; ++j) {
                if(x>=A[i][j]) {
                    x=A[i][j];
                    B[i]=x;
                }
            }
        }
    }
    printf("\n\n");
    for(int i=0; i<4; ++i) {
        printf("%d ", B[i]);
    }
    return 0;
}
