#include <stdio.h>
#include <stdlib.h>
/*Дан вещественный массив A[4][5]. Необходимо определить значения вещественного массива B[4] по правилу:
B[i] = максимальному значению i-й строки массива A, если A[i][0] >= 0.
B[i] = минимальному значению i-й строки массива A, если A[i][0] < 0.
Значение переменной i изменяется от 0 до 3.*/
int main() {
    int A[4][5]={{-6,2,3,4,5},
                 {-1,-2,-13,-4,-5},
                 {9,8,7,12,5},
                 {-9,-8,-7,-16,-5}};
    int B[4];
    int x=0, y=9999;
    for(int i=0; i<4; ++i) {
        for(int j=0; j<5; ++j) {
            printf("%d\t",A[i][j]);
        }
        printf("\n");
    }
    for(int i=0; i<4; ++i) {
        if(A[i][0]>=0) {
            for(int j=0; j<5; ++j) {
                if(A[i][j]>x) {
                    x=A[i][j];
                    B[i]=x;
                } 
            }
            x=0;
        } 
        if(A[i][0]<0) {
            for(int j=0; j<5; ++j) {
                if(A[i][j]<y) {
                    y=A[i][j];
                    B[i]=y;
                } 
            }
            y=9999;
        } 
    }
    printf("\n\n");
    for(int i=0; i<4; ++i) {
        printf("%d ", B[i]);
    }
    
    return 0;
}
